Autodesk.Revit.UI.RibbonItem.Enabled
Gets or sets a value indicating whether the item is enabled.
Remarks: When the Enabled property is set to false, the item cannot be clicked,
and the item's appearance changes. The Image and Text assigned to the item appear grayed
out. If the relevant external command cannot be executed, setting Enabled to true won't have an effect.
The push button will be disabled when there is no active document unless availability class of that button returns true.

Autodesk.Revit.UI.RibbonItem
The RibbonItem object represents an item on RibbonPanel, can be a push-button or a pull-down
which should contain the information for creating one RibbonItem.
Remarks: This class is not supported in Revit VSTA.